{
  "fr": {
    "default": "Je vous remercie pour votre question. Je suis heureux de pouvoir vous présenter plus en détail le parcours de M. RANDRIANIAINA Maminirina Jean Noël. Pourriez-vous préciser votre demande (formation, expérience, compétences techniques, projets, disponibilité…) afin que je puisse vous répondre avec la plus grande précision ?",

    "bonjour|salut|hello|hi|bonsoir": "Bonjour et bienvenue ! Je suis l’assistant virtuel de Maminirina Jean Noël RANDRIANIAINA, développeur fullstack basé à Antananarivo, Madagascar. Je reste à votre entière disposition pour toute information concernant son parcours professionnel, ses compétences ou ses projets. Comment puis-je vous aider aujourd’hui ?",

    "qui es-tu|who are you|c'est qui|présente-toi": "Je suis Maminirina Bot, l’assistant intelligent dédié à RANDRIANIAINA Maminirina Jean Noël. Je suis ici pour vous présenter son profil complet, répondre à vos questions sur ses expériences, formations, compétences techniques ou projets réalisés, et faciliter tout échange professionnel.",

    "nom|prénom|âge|âge": "M. RANDRIANIAINA Maminirina Jean Noël est un jeune développeur fullstack dynamique, âgé d’environ 24 ans, basé à Antananarivo, Madagascar.",

    "contact|téléphone|email|coordonées": "Vous pouvez le contacter très facilement :\n• Téléphone : +261 34 74 956 07 ou +261 33 41 477 68\n• Email professionnel : maminirinajeannoel@gmail.com\n• LinkedIn : linkedin.com/in/jean-noel-maminirina\n• GitHub : github.com/maminirina593\nIl répond généralement dans les plus brefs délais.",

    "formation|études|diplôme|parcours|master|licence": "Maminirina poursuit actuellement un Master 1 en Génie Logiciel à l’IS-INFO Ampasamadinika (2025–en cours). Il est titulaire d’une Licence en Développement d’Applications (2022–2025) obtenue dans le même établissement. Il a également obtenu en septembre 2025 le Certificat Fullstack Node.js + React + MongoDB délivré par l’Orange Digital Center.",

    "expérience|stage|professionnel|emploi": "De janvier à mai 2025, Maminirina a effectué un stage de 5 mois au sein de la Direction Générale des Impôts (SSIF – Service du Système d’Information Fiscal). Il y a conçu et développé une application web complète de gestion et de suivi des projets informatiques, utilisant le framework Symfony 6, PostgreSQL et Bootstrap. Cette mission lui a permis de travailler en environnement professionnel réel et de renforcer ses compétences fullstack.",

    "compétences|skills|techno|technologie|stack": "Maminirina maîtrise un stack technique très complet :\nFrontend : React, Vue.js, Bootstrap, Tailwind CSS\nBackend : PHP (Symfony, Laravel), Python (Django), Node.js + Express\nBases de données : MySQL, PostgreSQL, MongoDB\nLangages : JavaScript (ES6+), Java, HTML5, CSS3/Sass\nOutils : Git, GitHub, VS Code, Photoshop, Premiere Pro\nMéthodologies : UML, MERISE, gestion agile\nIl possède également de solides soft skills : rigueur, autonomie, travail en équipe, gestion du temps et forte capacité d’apprentissage.",

    "projet|projets|réalisation|portfolio": "Parmi ses projets les plus aboutis :\n• Application de gestion de stock (PHP/MySQL et version Django + React)\n• Plateforme de suivi de projets IT avec diagramme de Gantt (Symfony + PostgreSQL)\n• Portfolio personnel actuel (100 % HTML/CSS/JS avec animations modernes, mode sombre, multilingue)\n• Jeu Tic Tac Toe avec IA intégrée\n• Planning de Travail Annuel (PTA) et gestion de cotisations d’association\n• Intégration pixel-perfect PSD → Sass + jQuery\nTous les codes sources sont disponibles sur son GitHub : github.com/maminirina593",

    "cv|curriculum|resume": "Vous pouvez télécharger son CV mis à jour directement ici :\n→ cv/cv.pdf\nIl contient l’ensemble de ses expériences, formations, compétences et projets.",

    "disponible|stage|emploi|recrutement|embauche": "Maminirina est actuellement à la recherche d’un stage de fin d’études (pré-embauche fortement souhaité) ou d’un premier poste en CDI en tant que développeur fullstack / web. Il est immédiatement disponible et très motivé à rejoindre une équipe dynamique.",

    "merci|thank": "Je vous remercie sincèrement pour l’intérêt que vous portez au profil de Maminirina. N’hésitez pas à me solliciter pour toute information complémentaire ou pour organiser un échange direct. Je lui transmettrai votre message avec plaisir. Excellente journée à vous !"
  },

  "en": {
    "default": "Thank you very much for your question. I would be delighted to provide you with detailed information about Mr. RANDRIANIAINA Maminirina Jean Noël’s background. Could you please specify your request (education, experience, technical skills, projects, availability…) so that I can assist you as precisely as possible?",

    "bonjour|salut|hello|hi|bonsoir": "Good morning and welcome! I am the virtual assistant of Maminirina Jean Noël RANDRIANIAINA, a full-stack developer based in Antananarivo, Madagascar. I am at your entire disposal for any information regarding his professional background, skills, or projects. How may I assist you today?",

    "qui es-tu|who are you|c'est qui|présente-toi": "I am Maminirina Bot, the dedicated intelligent assistant of Mr. RANDRIANIAINA Maminirina Jean Noël. My role is to present his complete profile, answer your questions about his experience, education, technical skills, and projects, and facilitate any professional exchange.",

    "nom|prénom|âge|âge": "Mr. RANDRIANIAINA Maminirina Jean Noël is a dynamic 24-year-old full-stack developer based in Antananarivo, Madagascar.",

    "contact|téléphone|email|coordonées": "You can reach him very easily:\n• Phone: +261 34 74 956 07 or +261 33 41 477 68\n• Professional email: maminirinajeannoel@gmail.com\n• LinkedIn: linkedin.com/in/jean-noel-maminirina\n• GitHub: github.com/maminirina593\nHe usually replies promptly.",

    "formation|études|diplôme|parcours|master|licence": "Maminirina is currently pursuing a Master’s degree (M1) in Software Engineering at IS-INFO Ampasamadinika (2025–ongoing). He holds a Bachelor’s degree in Application Development (2022–2025) from the same institution and obtained the Fullstack Web Development Certificate (Node.js + React + MongoDB) from Orange Digital Center in September 2025.",

    "expérience|stage|professionnel|emploi": "From January to May 2025, he completed a 5-month internship at the General Directorate of Taxes (SSIF). He designed and developed a complete web application for managing and tracking IT projects using Symfony 6, PostgreSQL, and Bootstrap. This experience strengthened his full-stack skills in a real professional environment.",

    "compétences|skills|techno|technologie|stack": "Maminirina has a comprehensive and up-to-date technical stack:\nFrontend: React, Vue.js, Bootstrap, Tailwind CSS\nBackend: PHP (Symfony, Laravel), Python (Django), Node.js + Express\nDatabases: MySQL, PostgreSQL, MongoDB\nLanguages: JavaScript (ES6+), Java, HTML5, CSS3/Sass\nTools: Git, GitHub, VS Code, Photoshop, Premiere Pro\nMethodologies: UML, MERISE, Agile project management\nStrong soft skills: rigor, autonomy, teamwork, time management, and fast learning ability.",

    "projet|projets|réalisation|portfolio": "Among his most accomplished projects:\n• Inventory management system (PHP/MySQL and Django + React version)\n• IT project tracking platform with Gantt chart (Symfony + PostgreSQL)\n• Current personal portfolio (pure HTML/CSS/JS with modern animations, dark mode, multilingual)\n• Tic Tac Toe game with integrated AI\n• Annual Work Plan (PTA) and association membership management\n• Pixel-perfect PSD → Sass + jQuery integration\nAll source codes are available on his GitHub: github.com/maminirina593",

    "cv|curriculum|resume": "You can download his latest CV directly here:\n→ cv/cv.pdf\nIt includes all his experiences, education, skills, and projects.",

    "disponible|stage|emploi|recrutement|embauche": "Maminirina is currently seeking an end-of-studies internship (with strong preference for pre-employment) or a first permanent position as a full-stack/web developer. He is immediately available and highly motivated to join a dynamic team.",

    "merci|thank": "Thank you sincerely for your interest in Maminirina’s profile. Please do not hesitate to contact me for any additional information or to arrange a direct discussion. I will gladly forward your message to him. Wishing you an excellent day!"
  }
}