{
  "fr": {
    "default": "Merci pour votre message. Je suis là pour vous présenter le parcours complet de M. RANDRIANIAINA Maminirina Jean Noël. Pourriez-vous préciser votre question (expérience, formation, compétences, projets, disponibilité, contact…) afin que je puisse vous répondre avec précision ?",

    "bonjour|salut|hello|hi|bonsoir|hey|cc|coucou|salutation": "Bonjour et bienvenue ! Je suis Maminirina Bot, l’assistant virtuel de Maminirina Jean Noël RANDRIANIAINA, développeur fullstack passionné basé à Antananarivo, Madagascar. Je suis à votre disposition pour toute question sur son parcours, ses compétences ou ses projets. En quoi puis-je vous aider aujourd’hui ?",

    "qui es-tu|qui êtes-vous|c'est qui|présente-toi|qui est maminirina|ton nom|bot": "Je suis Maminirina Bot, l’assistant intelligent dédié à RANDRIANIAINA Maminirina Jean Noël. Mon rôle est de vous présenter son profil de manière claire et professionnelle, répondre à toutes vos questions sur son parcours, ses compétences techniques, ses projets ou sa disponibilité pour un stage/emploi.",

    "nom|prénom|âge|quel âge|né en|date de naissance": "M. RANDRIANIAINA Maminirina Jean Noël est un jeune développeur fullstack talentueux de 24 ans (né en 2001), basé à Antananarivo, Madagascar. Dynamique, rigoureux et passionné par le développement web.",

    "où habites-tu|adresse|localisation|ville|pays|madagascar": "Maminirina vit et travaille à Antananarivo (Isaingy), Madagascar. Il est mobile et ouvert à des opportunités locales ou en télétravail.",

    "contact|telephone|numéro|phone|email|mail|coordonées|linkedin|github": "Voici ses coordonnées professionnelles :\n• Téléphone : +261 34 74 956 07 | +261 33 41 477 68\n• Email : maminirinajeannoel@gmail.com\n• LinkedIn : linkedin.com/in/jean-noel-maminirina\n• GitHub : github.com/maminirina593\nIl répond très rapidement !",

    "formation|études|diplôme|école|université|master|licence|is-info|orange": "Maminirina est actuellement en Master 1 Génie Logiciel à l’IS-INFO Ampasamadinika (2025–en cours). Il est titulaire d’une Licence en Développement d’Applications (2022–2025) et a obtenu en septembre 2025 le prestigieux Certificat Fullstack Node.js + React + MongoDB de l’Orange Digital Center.",

    "expérience|stage|professionnel|emploi|dgi|impôts|ssif": "Oui ! De janvier à mai 2025, il a effectué un stage de 5 mois à la Direction Générale des Impôts (SSIF). Il y a conçu une application complète de gestion et suivi des projets informatiques avec Symfony 6, PostgreSQL et Bootstrap. Une expérience très formatrice en environnement professionnel réel.",

    "compétences|skills|techno|stack|langages|framework|base de données": "Maminirina maîtrise un stack très complet :\nFrontend : React, Vue.js, Bootstrap, Tailwind CSS\nBackend : PHP (Symfony, Laravel), Python (Django), Node.js + Express\nBases de données : MySQL, PostgreSQL, MongoDB\nLangages : JavaScript (ES6+), Java, HTML5, CSS3/Sass\nOutils : Git, GitHub, VS Code, Photoshop, Premiere Pro\nMéthodologies : UML, MERISE, Agile\nSoft skills : rigueur, autonomie, travail en équipe, apprentissage rapide.",

    "projet|projets|réalisation|portfolio|github|gstock|suivi|django|tictactoe|pta|cotisation|agency": "Maminirina a réalisé de nombreux projets de haut niveau :\n• Gestion de stock (PHP & Django + React)\n• Suivi de projets IT avec Gantt (Symfony + PostgreSQL)\n• Portfolio actuel (100 % vanilla, animations modernes, multilingue)\n• Tic Tac Toe avec IA\n• Planning de Travail Annuel (PTA)\n• Gestion de cotisations d’association\n• Intégration pixel-perfect PSD → Sass + jQuery\nTous les codes sont publics sur : github.com/maminirina593",

    "cv|curriculum|resume|télécharger|pdf": "Vous pouvez télécharger son CV complet et à jour ici :\n→ cv/cv.pdf\nIl contient toutes ses expériences, formations, compétences et projets.",

    "disponible|stage|emploi|recrutement|embauche|cdi|alternance|pré-embauche|ouvert": "Oui, Maminirina est actuellement disponible immédiatement pour un stage de fin d’études (avec forte préférence pour une pré-embauche) ou un premier poste en CDI en tant que développeur fullstack/web. Il est très motivé et prêt à rejoindre une équipe dynamique !",

    "anglais|english|parle anglais|langue": "Oui, Maminirina parle anglais couramment (niveau professionnel). Il a suivi une formation certifiée en anglais parlé et communique sans difficulté avec des équipes internationales.",

    "passion|hobby|loisir|temps libre": "En dehors du code, Maminirina est passionné par le design UI/UX, les animations web, le montage vidéo (Premiere Pro), la musique et le basketball. Il adore apprendre de nouvelles technologies et relever des défis techniques !",

    "merci|thanks|thank you|super|top|genial|parfait": "Je vous remercie sincèrement pour l’intérêt que vous portez au profil de Maminirina ! N’hésitez pas à me poser d’autres questions ou à le contacter directement. Je transmets tous vos messages avec plaisir. Excellente journée à vous !"
  },

  "en": {
    "default": "Thank you for your message. I’m here to introduce you to the full profile of Mr. RANDRIANIAINA Maminirina Jean Noël. Could you specify your question (experience, education, skills, projects, availability, contact…) so I can answer you accurately?",

    "bonjour|salut|hello|hi|bonsoir|hey|cc": "Hello and welcome! I am Maminirina Bot, the virtual assistant of Maminirina Jean Noël RANDRIANIAINA, a passionate full-stack developer based in Antananarivo, Madagascar. How may I assist you today?",

    "qui es-tu|who are you|who is maminirina": "I am Maminirina Bot, the dedicated AI assistant of Mr. RANDRIANIAINA Maminirina Jean Noël. I present his full profile and answer all questions about his background, skills, projects, and availability.",

    "nom|name|age|old": "Mr. RANDRIANIAINA Maminirina Jean Noël is a talented 24-year-old full-stack developer from Antananarivo, Madagascar.",

    "contact|phone|email|linkedin|github": "Here are his contact details:\n• Phone: +261 34 74 956 07 | +261 33 41 477 68\n• Email: maminirinajeannoel@gmail.com\n• LinkedIn: linkedin.com/in/jean-noel-maminirina\n• GitHub: github.com/maminirina593\nHe replies very quickly!",

    "formation|education|studies|degree|master|license": "Currently pursuing a Master’s in Software Engineering at IS-INFO (2025–ongoing). Holds a Bachelor’s in Application Development (2022–2025) and earned the Fullstack Web Development Certificate (Node.js + React + MongoDB) from Orange Digital Center in September 2025.",

    "expérience|experience|internship|job|dgi|tax": "Yes! 5-month internship (Jan–May 2025) at the General Directorate of Taxes (SSIF). Developed a full project management & tracking web app using Symfony 6, PostgreSQL, and Bootstrap.",

    "compétences|skills|tech|stack": "Full-stack expertise:\nFrontend: React, Vue.js, Bootstrap, Tailwind\nBackend: PHP (Symfony/Laravel), Python (Django), Node.js + Express\nDatabases: MySQL, PostgreSQL, MongoDB\nTools: Git, GitHub, VS Code, Photoshop, Premiere Pro\nStrong soft skills: rigor, autonomy, teamwork, fast learner.",

    "projet|projects|portfolio|github": "Notable projects:\n• Inventory management (PHP & Django + React)\n• IT project tracker with Gantt chart (Symfony)\n• This modern portfolio (vanilla JS, animations, multilingual)\n• Tic Tac Toe with AI\n• Annual Work Plan system\n• Association membership management\nAll open-source: github.com/maminirina593",

    "cv|resume|download": "Download his latest CV here:\n→ cv/cv.pdf",

    "disponible|available|job|internship|hiring": "Yes, Maminirina is immediately available for a final-year internship (preferably with pre-employment) or a full-time junior full-stack developer position. Highly motivated!",

    "merci|thanks|thank you": "Thank you so much for your interest in Maminirina’s profile! Feel free to ask more or contact him directly. Have an excellent day!"
  }
}